src/cf/Catalogs/НастройкиХозяйственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиХозяйственныхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточникаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВБюджетировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиРегистра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ПоказателиАналитическихРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПоказателиАналитическихРегистров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Себестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьРегл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьРегл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалюте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетовДебета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетовКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалютеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаВВалютеПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДопРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДопРасходовБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНДСДопРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПостоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаРегл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаУпр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиХозяйственныхОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает макет со схемой получения данных.
//
// Параметры:
//  ХозяйственнаяОперация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СхемаПолученияДанных(ХозяйственнаяОперация) Экспорт

	СхемаПолученияДанных = Неопределено;
	ИмяИсточникаДанных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХозяйственнаяОперация, "ИсточникДанных");
	МакетыИсточниковПолученияДанных = Метаданные.Справочники.НастройкиХозяйственныхОпераций.Макеты;
	МакетИсточникаПолученияДанных = МакетыИсточниковПолученияДанных.Найти(ИмяИсточникаДанных);
	Если МакетИсточникаПолученияДанных <> Неопределено Тогда
		ИмяСхемы = МакетИсточникаПолученияДанных.Имя; 
		СхемаПолученияДанных = Справочники.НастройкиХозяйственныхОпераций.ПолучитьМакет(ИмяСхемы);
	КонецЕсли;
	
	Возврат СхемаПолученияДанных;

КонецФункции

// {УП}
//
// Параметры:
//  ИмяРегистра	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПоказателиРегистра(ИмяРегистра) Экспорт

	Если ПустаяСтрока(ИмяРегистра) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Показатели = МеждународныйУчетСерверПовтИсп.Показатели(ИмяРегистра);
	
	Возврат Показатели;

КонецФункции
//{/УП}

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УП 2.0.4.6.
//  Заполняет предопределенные элементы справочника "НастройкиХозяйственныхОпераций".
//
Процедура ЗаполнитьПредопределенныеНастройкиХозяйственныхОпераций() Экспорт

	РеквизитыXML = Справочники.НастройкиХозяйственныхОпераций.ПолучитьМакет("НастройкиПредопределенныхЭлементов").ПолучитьТекст();
	РеквизитыТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(РеквизитыXML).Данные;
	
	СвязанныеДокументыXML = Справочники.НастройкиХозяйственныхОпераций.ПолучитьМакет("СвязанныеДокументы").ПолучитьТекст();
	СвязанныеДокументыТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(СвязанныеДокументыXML).Данные;
	
	Для каждого СтрокаТаблРеквизитов Из РеквизитыТаблица Цикл
		ID = СтрокаТаблРеквизитов.ID;
		Объект = Справочники.НастройкиХозяйственныхОпераций[ID].ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, СтрокаТаблРеквизитов);
		
		Приход = СтрокаТаблРеквизитов.Приход;
		Если ЗначениеЗаполнено(Приход) Тогда
			Объект.Приход = Перечисления.ТипыДанныхУчета[Приход];
		КонецЕсли;
		
		Расход = СтрокаТаблРеквизитов.Расход;
		Если ЗначениеЗаполнено(Расход) Тогда
			Объект.Расход = Перечисления.ТипыДанныхУчета[Расход];
		КонецЕсли;
		
		Хозоперация = СтрокаТаблРеквизитов.ХозяйственнаяОперация;
		Если ЗначениеЗаполнено(Хозоперация) Тогда
			Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации[Хозоперация];
		КонецЕсли;
		
		НайденныеСтроки = СвязанныеДокументыТаблица.НайтиСтроки(Новый Структура("OwnerID", ID));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если Объект.Документы.Найти(НайденнаяСтрока.ИмяДокумента, "ИмяДокумента") = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.Документы.Добавить(), НайденнаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Объект.Документы.Сортировать("ПредставлениеДокумента");
		
		//{УП}
		ПоказателиРегистра = ПоказателиРегистра(Объект.ИсточникДанных);
		Если ПоказателиРегистра <> Неопределено Тогда
			Объект.ПоказателиРегистра.Очистить();
			Для каждого Показатель Из ПоказателиРегистра Цикл
				НоваяСтрока = Объект.ПоказателиРегистра.Добавить();
				НоваяСтрока.Показатель = Показатель.Ключ;
				НоваяСтрока.Использование = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.АмортизацияВнеоборотныхАктивов Тогда
			Объект.ПоказателиРегистра.Очистить();
			Строка = Объект.ПоказателиРегистра.Добавить();
			Строка.Показатель = Перечисления.ПоказателиАналитическихРегистров.Сумма;
			Строка.Использование = Истина;
		ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтражениеНДФЛ Тогда
			Объект.ПоказателиРегистра.Очистить();
			Строка = Объект.ПоказателиРегистра.Добавить();
			Строка.Показатель = Перечисления.ПоказателиАналитическихРегистров.Сумма;
			Строка.Использование = Истина;
		КонецЕсли;
		
		Объект.ПоказателиРегистра.Сортировать("Показатель");
		//{/УП}
		
		//ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
